// 霸都丶傲天 2021年5月26日 https://github.com/AJLoveChina/birthday
var config = {
    // 句子的长度可以任意， 你可以写十句话， 二十句话都可以
    // 每句话尽量不要超过15个字,不然展示效果可能不太好
    texts: [
        "送给超级彩虹^_^",      //这里,每句话结尾的最后一个逗号必须是英文的哦!! 很重要哦!!
        "今天是你的生日",
        "那就生日快乐呗~",
        "我发现你挺喜欢拍照袄~": "./imgs/1.jpg",
        "这张照片": "./imgs/2.jpg",
        "还有这张照片": "./imgs/3.jpg",
        "呐~ 还有这张": "./imgs/4.jpg",
        "让我看按这是哪个小可耐": "./imgs/5.jpg",
        "这也太帅了吧": "./imgs/6.jpg",
        "我也太幸福了吧": "./imgs/7.jpg",
        "你说我点儿怎么这么正": "./imgs/8.jpg",
        "长你身上算了，你说腻": "./imgs/9.jpg",
        "快说你爱我，不然K98警告⚠️": "./imgs/10.jpg",
        "超级彩虹撞上超级月亮了",
        "一轮圆月": "./imgs/11.jpg",
        "万丈长虹": "./imgs/12.jpg",
        "每天开心袄~ 生日快乐鸭~",
    ],
    /**
     * imgs 可以不填, 但是如果要填写的话必须遵循下面的格式
     * "对应上面的文字, 要完全一样" : "图片地址, 可以把图片放在imgs文件夹中"
     * 例如
     * "心爱的小可爱": "./imgs/xiaokeai.jpg"
     *
     * 如果不要图片的话, 直接在每行开头写两个斜杠注释即可, 例如下面的 "今天是你的生日" 的图片就不会展示了:)
     * Tip: 图片最好用正方形or接近正方形, 看起来效果更好
     */
    imgs: {
        "送给王晓婷同学": "./imgs/王晓婷.jpg",
        "今天是你的生日": "./imgs/王晓婷.jpg",
    },
    // 按钮文字描述, 以下是默认的按钮文字，英文的，您可以改成你喜欢的文字
    desc: {
        turn_on: "戳戳看",
        play: "是不是缺少音乐？",
        bannar_coming: "背景颜色变了嗷",
        balloons_flying: "好像还少点东西",
        cake_fadein: "给你点个蛋糕",
        light_candle: "然后点燃蜡烛",
        wish_message: "祝王晓婷生日快乐",
        story: "我想对你说",
    }
};
